app/controllers/comments_controller.rb

  def index
    @presenter = {
      :comments => Comment.last(5),
      :form => {
---
SELECT  "comments".* FROM "comments"  ORDER BY "comments"."id" DESC LIMIT 5

  def create
    @comment = Comment.new(comment_params)
    @comment.save

    if request.xhr?
      render :json => Comment.last(5)
---
INSERT INTO "comments" ("author", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "ami"], ["comment", "this is a test"], ["created_at", "2015-12-18 05:18:27.088785"], ["updated_at", "2015-12-18 05:18:27.088785"]]
SELECT  "comments".* FROM "comments"  ORDER BY "comments"."id" DESC LIMIT 5